Repository: ElChoquito/GHFollowers
Catalog: Sources/GHFollowers/GHFollowers/*.lproj/Localizable.strings
Languages: fr

# searchViewController.calToActionButton.title
source: Get Followers
fr: Voir les abonnés

# searchViewController.emptyUsername.alert.title
source: Empty Username
fr: Utilisateur absent

# searchViewController.emptyUsername.alert.message
source: Please enter a username. We need to know who to look for 🙂
fr: Entrez un nom d'utilisateur. Nous avons besoin de savoir qui rechercher 🙂

# searchViewController.usernameTextField.accessibilityLabel
source: GitHub username
fr: Nom d'utilisateur GitHub

# searchViewController.callToActionButton.accessibilityHint
source: Double tap to search GitHub followers.
fr: Toucher deux fois pour rechercher les abonnés GitHub.

# followerListViewController.searchBar.placeholder
source: Search for a username
fr: Rechercher un utilisateur

# followerListViewController.emptyStateView.message
source: This user doesn't have any followers. Go follow them 😉
fr: Cet utilisateur n'a pas d'abonnés. Allez le suivre 😉

# followerListViewController.userAddedSuccess.alert.title
source: Success !
fr: Succès !

# followerListViewController.userAddedSuccess.alert.message
source: You have successfully favortied this user ! 🥳
fr: Vous avez ajouté en favoris cet utilisateur avec succès ! 🥳

# followerListViewController.userAddedSuccess.alert.button
source: Hooray !
fr: Hourra !

# followerListViewController.addButton.accessibilityLabel
source: Add a favorite.
fr: Ajouter un favoris.

# followerListViewController.addButton.accessibilityHint
source: Double tap to add %@ as a favorite.
fr: Toucher deux fois pour ajouter %@ comme favoris.

# favoriteListViewController.title
source: Favorite
fr: Favoris

# favoriteListViewController.emptyStateView.message
source: No Favorites Add one on the follower screen
fr: Aucun favoris Ajoutez-en un via l'écran des abonnés

# favoriteListViewController.removeUserError.alert.title
source: Unable to remove
fr: Impossible de supprimer

# userInfoViewController.dateLabel.text
source: GitHub since %@
fr: GitHub depuis %@

# userInfoViewController.noFollowers.alert.title
source: No followers
fr: Aucun abonnés

# userInfoViewController.noFollowers.alert.message
source: This user has no followers. What a shame ☹️
fr: Cet utilisateur n'a pas d'abonnés. C'est honteux ☹️

# userInfoViewController.noFollowers.alert.button
source: So sad
fr: Trop triste

# gfRepoItemViewController.actionButton.title
source: GitHub Profile
fr: Profile GitHub

# gfRepoItemViewController.actionButton.accessibilityHint
source: Double tap to see %@ profile on GitHub website.
fr: Toucher deux fois pour afficher le profile de %@ sur le site GitHub.

# gfFollowerItemViewController.actionButton.title
source: Get Followers
fr: Voir abonnés

# gfFollowerItemViewController.actionButton.accessibilityHint
source: Double tap to see %@ followers.
fr: Toucher deux fois pour afficher les abonnés de %@.

# gfUserInfoHeaderViewController.locationLabel.defaultText
source: No location
fr: Aucune localisation

# gfUserInfoHeaderViewController.avatarImageView.accessibilityLabel
source: User profil picture
fr: Photo de profile de l'utilisateur

# gfUserInfoHeaderViewController.usernameLabel.accessibilityLabel
source: Username
fr: Nom d'utilisateur

# gfUserInfoHeaderViewController.nameLabel.accessibilityLabel
source: Name
fr: Nom

# gfTextField.placeholder.text
source: Enter a username
fr: Entrez un nom d'utilisateur

# gfItemInfoView.titleLabel.repos.text
source: Public Repos
fr: Repos publiques

# gfItemInfoView.titleLabel.gists.text
source: Public Gists
fr: Gists publiques

# gfItemInfoView.titleLabel.followers.text
source: Followers
fr: Abonnés

# gfItemInfoView.titleLabel.following.text
source: Following
fr: Abonnements

# gfAlertViewController.titleLabel.defaultText
source: Something went wrong
fr: Erreur survenue

# gfAlertViewController.messageLabel.defaultText
source: Unable to complete request.
fr: Impossible d'effectuer la requête.

# gfError.invalidUsername.message
source: This username created an invalid request. Please try again.
fr: Cet utilisateur créer une requête invalide. Réessayer.

# gfError.unableToComplete.message
source: Unable to complete your request. Please check your internet connection.
fr: Impossible d'effectuer votre requête. Veuiller vérifier votre connection internet.

# gfError.invalidResponse.message
source: Invalid response from the server. Please try again.
fr: Réponse invalide du serveur. Réessayer.

# gfError.invalidData.message
source: The data received from the server was invalid. Please try again.
fr: Les données reçues sont invalides. Réessayer.

# gfError.unableToFavorite.message
source: There was an error favoriting this user. Please try again.
fr: Erreur lors de l'ajout aux favoris.

# gfError.alreadyInFavorites.message
source: You've already favoritd this user. You must REALLY like them !
fr: Utilisateur déjà favoris. Vous devez VRAIMENT l'aimer.

# followerCell.accessibilityHint
source: Double tap to see user profil.
fr: Toucher deux fois pour voir le profil de l'utilisateur.

# followerCell.accessibilityLabel
source: User: %@.
fr: Utilisateur: %@.

# favoriteCell.accessibilityHint
source: Double tap to see %@ followers.
fr: Toucher deux fois pour voir les abonnées de %@.
